// ЛР 11 ОП.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
// Додавання завдання л/р
/*Завдання: Створити масив структур, який містить відомості про товари деякого складу.
Кожна структура містить поля – найменування, ціна одиниці товару, кількість.
Написати програму, яка видає перелік товарів, вартість яких не перевищує Х гривень із зазначенням кількості; загальна кількість товарів, вартість яких не перевищує Х.
Вартість Х вводиться за запитом із клавіатури.*/

#include <iostream>
#include <iomanip>
using namespace std;

struct Store
{
    int count;
    float price;
    char name[10];
};

int l, i, j;
float x;

int main()
{
    l = 0;
    j = 5;
    Store A[j];
    cout << "   Введіть назву малими літерами(не більше 10 символів), кількість і ціну товару через пробіл:  " << endl;
    cout << endl;
    for (i = 1; i <= 5; i++)
    {
        cin >> A[i].name >> A[i].count >> A[i].price;
        cout << endl;
    }
 // Видалення роздільника
    cout << "   Введіть рівень ціни товару (грн): ";
    cin >> x; cout << endl;
    cout << "    Товари, ціна яких не перевищує " << x << " грн" << endl;
    for (i = 1; i <= 5; i++)
        if (A[i].price <= x)
        {
            cout << "     " << A[i].name << "     " << A[i].count << " шт." << endl;
            l = l + A[i].count;

        }
    cout << "    Загальна кількість товарів з ціною яка не перевищує " << x << " грн. дорівнює " << l << " шт.";
    return 0;
}
